app/controllers/articles_controller.rb

    def create
        @article = Article.new(article_params)
        @article.name = params[:article][:name]

        if @article.save
---
INSERT INTO "articles" ("name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Charles Samoy"], ["body", "teset"], ["created_at", "2020-11-17 06:09:27.697353"], ["updated_at", "2020-11-17 06:09:27.697353"]]

    def delete
        @article = Article.find(params[:id])

        if @article.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 7]]